#include <iostream>
#include <unordered_map>
// Вашей семиколенной сестре Прасковье нужно помочь с развитием магазина строительных материалов. Она хочет создать такой справочник с ценами, чтобы она не листала его,
// а сразу находила цену на нужный товар. Реализуйте хэш-таблицу в виде класса HashTable,
// в котором реализованы методы добавления, удаления, поиска значения (цены) ключа (товара), проверки на пустую таблицу, получения размера таблицы. В конструкторе по умолчанию создаётся создаётся пустой объект на 10 позиций
class HashTable{
    std::unordered_map<std::string,std::string> tabl;
    HashTable(10,):
    void Apend(){

    }
}